In [1]:
import pandas as pd
import io
import numpy as np

In [3]:
data = pd.read_csv("student.csv")

In [4]:
data

   SI.NO       Name Qualification      Mobile   Address
0      1      navya           MCA   789654239    puttur
1      2  nikshitha           MCA   357892658    puttur
2      3    shrunga           MCA   567342980    Mysore
3      4       neha           MBA  4578643533       NaN
4      5    deeksha           NaN  1238905438    puttur
5      6    merolin           MCA  4567893456    puttur
6      7    manisha           MBA  3456784321  manglore
7      8     vridhi           MBA  3452347895  manglore
8      9  charithra           MCA  4356756789    puttur
9     10  shruthika           MCA  2349865422    puttur

In [5]:
data.head(5)

   SI.NO       Name Qualification      Mobile Address
0      1      navya           MCA   789654239  puttur
1      2  nikshitha           MCA   357892658  puttur
2      3    shrunga           MCA   567342980  Mysore
3      4       neha           MBA  4578643533     NaN
4      5    deeksha           NaN  1238905438  puttur

In [9]:
data.isnull().sum()

SI.NO            0
Name             0
Qualification    1
Mobile           0
Address          1
dtype: int64

In [16]:
data["Qualification"]=data["Qualification"].fillna("MCA")

In [17]:
data

   SI.NO       Name Qualification      Mobile   Address
0      1      navya           MCA   789654239    puttur
1      2  nikshitha           MCA   357892658    puttur
2      3    shrunga           MCA   567342980    Mysore
3      4       neha           MBA  4578643533       NaN
4      5    deeksha           MCA  1238905438    puttur
5      6    merolin           MCA  4567893456    puttur
6      7    manisha           MBA  3456784321  manglore
7      8     vridhi           MBA  3452347895  manglore
8      9  charithra           MCA  4356756789    puttur
9     10  shruthika           MCA  2349865422    puttur

In [18]:
data["Address"]=data["Address"].fillna("puttur")

In [19]:
data

   SI.NO       Name Qualification      Mobile   Address
0      1      navya           MCA   789654239    puttur
1      2  nikshitha           MCA   357892658    puttur
2      3    shrunga           MCA   567342980    Mysore
3      4       neha           MBA  4578643533    puttur
4      5    deeksha           MCA  1238905438    puttur
5      6    merolin           MCA  4567893456    puttur
6      7    manisha           MBA  3456784321  manglore
7      8     vridhi           MBA  3452347895  manglore
8      9  charithra           MCA  4356756789    puttur
9     10  shruthika           MCA  2349865422    puttur

In [20]:
array=np.array([[1,1,1],[2,3,8],[3,5,27],])

In [21]:
index_values=['row1','row2','row3']

In [22]:
coulumn_values=['col1','col2','col3']

In [25]:
df = pd.DataFrame(data = array,index = index_values,columns = coulumn_values)

In [26]:
print(df)

      col1  col2  col3
row1     1     1     1
row2     2     3     8
row3     3     5    27

In [27]:
trace=np.trace(df)

In [28]:
print("Trace of matrix",trace)

Trace of matrix 31

In [29]:
print(df)

      col1  col2  col3
row1     1     1     1
row2     2     3     8
row3     3     5    27